ineed2underfit/learn_stm32/oled/Hardware/led.c
#include "stm32f10x.h"                  // Device header


void LED_Init(void){
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);  // 使能时钟
	GPIO_InitTypeDef GPIO_InitStructure;  // 定义结构体
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);  // GPIO 初始化
}

// LED1 开
void LED1_ON(void){
	GPIO_ResetBits(GPIOA, GPIO_Pin_1);
}

// LED1 关
void LED1_OFF(void){
	GPIO_SetBits(GPIOA, GPIO_Pin_1);
}

// LED1 输出状态取反
void LED1_Turn(void){
	if (GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_1) == 0){
		GPIO_SetBits(GPIOA, GPIO_Pin_1);  // 若为 0 则置 1
	}
	else
		GPIO_ResetBits(GPIOA, GPIO_Pin_1);  // 若为 1 则置 0
}


// LED2 开
void LED2_ON(void){
	GPIO_ResetBits(GPIOA, GPIO_Pin_2);
}

// LED2 关
void LED2_OFF(void){
	GPIO_SetBits(GPIOA, GPIO_Pin_2);
}

// LED2 输出状态取反
void LED2_Turn(void){
	if (GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_2) == 0){
		GPIO_SetBits(GPIOA, GPIO_Pin_2);  // 若为 0 则置 1
	}
	else
		GPIO_ResetBits(GPIOA, GPIO_Pin_2);  // 若为 1 则置 0
}

